stresstest.yml
config:
  target: "https://chatme.me"
  phases:
    - duration: 10
      arrivalRate: 1
    - duration: 30
      arrivalRate: 1
scenarios:
  - name: "a user saying hello"
    weight: 100
    engine: "socketio"
    flow:
      - emit:
          channel: "define user"
          data: "U2FsdGVkX1+lFm9bpNnZM95SHOz4XmoQFQErNx6ZggrOt7urNG8DDziHDOyWRY4f"
      - think: 2
      - emit:
          channel: "switch room"
          data: {name: "global", type: "global"}
      - think: 2
      - emit:
          channel: "send message"
          data: "hello to all the world!"
      - think: 4
      - emit:
          channel: "get media"
          data: "59f0398114d48a14637ff9a5"
          data: function(e) {console.log(e)}