stresstest.yml
config:
  target: "https://chatme.me"
  phases:
    - duration: 10
      arrivalRate: 1
    - duration: 30
      arrivalRate: 1
scenarios:
  - name: "a user saying hello"
    weight: 100
    engine: "socketio"
    flow:
      - emit:
          channel: "define user"
          data: "U2FsdGVkX1+lFm9bpNnZM95SHOz4XmoQFQErNx6ZggrOt7urNG8DDziHDOyWRY4f"
      - think: 2
      - emit:
          channel: "switch room"
          data: {name: "global", type: "global"}
      - think: 2
      - emit:
          channel: "send message"
          data: "hello to all the world!"
      - think: 4
      - emit:
          channel: "send message"
          data: "I like ponyes!"
      - think: 3
      - emit:
          channel: "send message"
          data: "hello kitty rules!"
      - think: 2
      - emit:
          channel: "send message"
          data: "hello to all the world!"
      - think: 5
      - emit:
          channel: "send message"
          data: "Lol123321334l234l32l4k32lk4lk32l4k3l234k!"
      - think: 2
      - emit:
          channel: "send message"
          data: "hello to all the world!"